Autodesk.Revit.DB.Visual.Generic.CommonTintColor
The property labeled "Tint Color" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.CommonTintToggle
The property labeled "Tint" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericBumpAmount
The property labeled "Amount" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "-1000, 1000".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericBumpMap
The property labeled "Bump" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericSelfIllumColorTemperature
The property labeled "Color Temperature" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericSelfIllumLuminance
The property labeled "Luminance" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericSelfIllumFilterMap
The property labeled "Filter Color" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericCutoutOpacity
The property labeled "Cutouts" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericRefractionIndex
The property labeled "Refraction" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0.01, 5".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericRefractionTranslucencyWeight
The property labeled "Translucency" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericTransparencyImageFade
The property labeled "Image Fade" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericTransparency
The property labeled "Transparency" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericReflectivityAt90deg
The property labeled "Reflectivity/Oblique" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericReflectivityAt0deg
The property labeled "Reflectivity/Direct" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericIsMetal
The property labeled "Highlights" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericGlossiness
The property labeled "Glossiness" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericDiffuseImageFade
The property labeled "Image Fade" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.ColorByObject
The property labeled "Color By Object" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic.GenericDiffuse
The property labeled "Color/Image" from the "Generic" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Generic
Represents the properties of materials.
Since:
2018.1